Revit 2026 API

# ExportLayerInfo Methods

---

The ExportLayerInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCutLayerModifier | Adds a cut layer modifier to the layer info. |
|  | AddLayerModifier | Adds a project layer modifier to the layer info. |
|  | ClearCutLayerModifiers | Clears all the cut layer modifiers stored in the layer info. |
|  | ClearLayerModifiers | Clears all the project layer modifiers stored in the layer info. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCutLayerModifiers | Gets all the cut layer modifiers from the layer info. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLayerModifiers | Gets all the project layer modifiers from the layer info. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveCutLayerModifier | Removes a cut layer modifier from the layer info. |
|  | RemoveLayerModifier | Removes a project layer modifier from the layer info. |
|  | SetCutLayerModifiers |  |
|  | SetLayerModifiers |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExportLayerInfo Class

Autodesk.Revit.DB Namespace